Repository: marberts/piar
Catalog: po/R-*.po
Languages: fr

source: 'pias' must be a price index aggregation structure; use aggregation_structure() to make one
fr: 'pias' doit être une structure d'agrégation d'indices de prix.; utilisez aggregation_structure() pour en faire un

source: 'repweights' must have a row for each weight in 'pias'
fr: 'repweights' doit avoir une ligne pour chaque poids dans 'pias'

source: 'x' cannot contain NAs
fr: 'x' ne peut pas contenir de NA

source: cannot make an aggregation structure with no elemental aggregates
fr: ne peut pas créer une structure d'agrégation sans agrégats élémentaires

source: all arguments must be the same length
fr: tous les arguments doivent avoir la même longueur

source: there are duplicated elemental aggregates; the last vector in 'x' should not have duplicates
fr: il y a des agrégats élémentaires dupliqués ; le dernier vecteur dans 'x' ne devrait pas avoir de doublons

source: there are duplicated nodes in the aggregation structure; the same value cannot appear across multiple levels of 'x'
fr: il existe des nœuds dupliqués dans la structure d'agrégation.; la même valeur ne peut pas apparaître sur plusieurs niveaux de 'x'

source: some nodes in the price index aggregation structure have multiple parent nodes; the aggregation structure does not represent a nested hierarchy
fr: certains nœuds de la structure d'agrégation de l'indice des prix ont plusieurs nœuds parents.; la structure d'agrégation ne représente pas une hiérarchie imbriquée

source: 'index' is not an aggregate index; use aggregate() to make one
fr: 'index' n'est pas un indice agrégé; utilisez aggregate() pour en faire un

source: not all weights in 'object' have a corresponding index value
fr: tous les poids dans 'object' n'ont pas de valeur d'indice correspondante

source: 'width' cannot contain NAs
fr: 'width' ne peut pas contenir de NA

source: cannot make an index with no periods or elemental aggregates
fr: ne peut pas faire un index sans périodes ou agrégats élémentaires

source: 'x' cannot have duplicated row or column names
fr: 'x' ne peut pas avoir de noms de lignes ou de colonnes dupliqués

source: 'link' must have a value for each level of 'x'
fr: 'link' doit avoir une valeur pour chaque niveau de 'x'

source: 'base' must have a value for each level of 'x'
fr: 'base' doit avoir une valeur pour chaque niveau de 'x'

source: 'is_chain_index()' is deprecated; use 'is_chainable_index()' instead
fr: 'is_chain_index()' est obsolète; utilisez 'is_chainable_index()' à la place

source: 'rel', 'period', and 'ea' must be the same length
fr: 'rel', 'period' et 'ea' doivent avoir la même longueur

source: 'rel', 'period', 'ea', 'w', must be the same length
fr: 'rel', 'period', 'ea' et 'w' doivent avoir la même longueur

source: some elements of 'rel or 'w' are less than or equal to 0
fr: certains éléments de 'rel' ou 'w' sont inférieurs ou égaux à 0

source: 'x', 'period', 'product, and 'ea' must be the same length
fr: 'x', 'period', 'product' et 'ea' doivent avoir la même longueur

source: 'x', 'period', 'product, 'ea', and 'w' must be the same length
fr: 'x', 'period', 'product', 'ea' et 'w' doivent avoir la même longueur

source: there are duplicated period-product pairs
fr: il existe des paires période-produit en double

source: cannot extract no levels/time periods from 'x'
fr: ne peut extraire aucun niveau/période de 'x'

source: 'y' is not an index; use elemental_index() to make one
fr: 'y' n'est pas un indice ; utilisez elemental_index() pour en faire un

source: 'x' and 'y' must be indexes for the same time periods
fr: 'x' et 'y' doivent être des index pour les mêmes périodes

source: the same levels appear in both 'x' and 'y'
fr: certains niveaux apparaissent à la fois dans 'x' et 'y'

source: cannot merge a fixed-base and period-over-period index
fr: ne peut pas fusionner un indice à base fixe et sur une période

source: cannot stack indexes of different orders
fr: ne peut pas empiler des index d'ordres différents

source: 'x' and 'y' must be generated from the same aggregation structure
fr: 'x' et 'y' doivent être générés à partir de la même structure d'agrégation

source: 'x' and 'y' must be indexes for the same levels
fr: 'x' et 'y' doivent être des index pour les mêmes niveaux

source: the same periods appear in both 'x' and 'y'
fr: certains points apparaissent à la fois dans 'x' et 'y'

source: cannot stack a period-over-period and a fixed-base index
fr: ne peut pas empiler un indice période sur période et un indice à base fixe

source: 'x' and 'w' must be the same length
fr: 'x' et 'w' doivent avoir la même longueur

source: 'x' must have at least 'window' time periods
fr: 'x' doit avoir au moins des périodes de 'window'
